{
  "id": "2026-01-23-water-institute-rebrand",
  "createdAt": "2026-01-23",
  "updatedAt": "2026-02-01",
  "status": "draft",
  "projectType": "web",
  "archivePath": "archive/unc-water-institute-rebrand",
  "clientId": "unc-water-institute",
  "clientName": "Catherine Rierson",
  "clientRole": "Conference & Project Coordinator",
  "clientEmail": "waterinstitute@unc.edu",
  "clientCompany": "UNC Water Institute",
  "projectName": "Website Rebrand — Essentials",
  "clientNote": "Note: This is a budget-friendly alternative to the previous estimate, designed to pass the UNC brand audit at minimal cost. It focuses on the most visible site-wide elements — header, footer, typography, and colors — while leaving individual page layouts and content untouched. This approach gives you brand compliance now without over-investing in a site that may be overhauled in the future.",
  "date": "February 1, 2026",
  "expirationDate": "February 7, 2026",
  "projectDescription": "Update the Water Institute website's most prominent brand elements to pass UNC's brand compliance audit. This includes implementing the new UNC website toolbar header across all pages, updating the footer with the Gillings School signature, switching all headline typography to Field Gothic No.36, all body copy to Open Sans, and replacing secondary accent colors with UNC Blue and Navy. Existing page layouts, Water Institute graphic elements, and linked PDFs will remain unchanged.",
  "estimatedTimeline": "1–2 weeks from kickoff. Designed to meet the February 28, 2026 compliance deadline.",
  "internalNotes": "Bare-minimum version — client needs to pass UNC brand audit but budget is tight and site may be overhauled later anyway. Only touching global elements: header (UNC toolbar), footer (Gillings signature), typography (Field Gothic + Open Sans), and colors (strip secondary colors → UNC blue/navy only). Keeping existing WI water droplet patterns, page layouts, and linked PDFs as-is. No argyle implementation on individual pages.",
  "phases": [
    {
      "name": "Planning & Asset Setup",
      "description": "Gather and configure all required brand assets: Field Gothic No.36 and Open Sans web fonts, UNC toolbar graphics, Gillings School signature, and updated color values. Map global Webflow classes and symbols that need updating.",
      "lowHrs": 4,
      "highHrs": 6,
      "rate": 120,
      "optional": false
    },
    {
      "name": "Header, Footer & Global Styles",
      "description": "Build new UNC toolbar header component with interlocking NC logo, 'UNC Gillings School of Global Public Health' and 'The Water Institute' text. Update footer with Gillings School signature. Apply Field Gothic No.36 to all main headlines and Open Sans to all body copy via global Webflow styles. Replace all secondary accent colors with UNC Blue and Navy.",
      "lowHrs": 10,
      "highHrs": 14,
      "rate": 120,
      "optional": false
    },
    {
      "name": "Page-Level Fixes",
      "description": "Review all 33 static pages and 14 CMS collection templates for any styling overrides or layout issues caused by the global changes. Fix broken layouts, typographic overrides, and color inconsistencies on a per-page basis.",
      "lowHrs": 4,
      "highHrs": 6,
      "rate": 120,
      "optional": false
    },
    {
      "name": "QA & Compliance Check",
      "description": "Cross-browser and device testing of header, footer, typography, and color changes. Verify the updated elements meet UNC brand audit requirements. Final review with client and deploy to production.",
      "lowHrs": 3,
      "highHrs": 5,
      "rate": 120,
      "optional": false
    }
  ],
  "projectSpecifics": "## What's Being Updated\n\n**Header (all pages)**\n- New UNC website toolbar matching the university-wide standard\n- 'UNC Gillings School of Global Public Health' primary line\n- 'The Water Institute' secondary line\n- Interlocking NC logo\n\n**Footer (all pages)**\n- Updated with Gillings School signature\n\n**Typography (all pages)**\n- Main headlines → Field Gothic No.36\n- Body copy → Open Sans\n\n**Colors (all pages)**\n- All secondary/accent colors replaced with UNC Blue or Navy\n- Existing Carolina Blue and Navy palette maintained\n\n---\n\n## What's Staying the Same\n\n- All existing page layouts and content\n- Water Institute water droplet patterns and page-level graphics\n- All linked PDFs (not updated to new brand)\n- All CMS content (team profiles, projects, publications, events, etc.)\n- All photography and images\n- Conference pages content and structure\n- Argyle pattern elements (not implemented on individual pages)",
  "exclusions": "- Page-level layout redesigns or content restructuring\n- Argyle graphic element implementation on individual pages\n- Updating linked PDFs to the new brand\n- Content creation or copywriting\n- New photography or image sourcing\n- Headless CMS upgrade\n- SEO optimization beyond existing setup\n- Social media profile updates\n- Print collateral design\n- Ongoing maintenance after launch\n- Additional revision rounds beyond two per phase",
  "upsells": [
    {
      "icon": "Layout",
      "title": "Full Brand Implementation",
      "description": "Complete page-by-page brand overhaul with argyle elements, updated PDFs, and individual layout adjustments."
    },
    {
      "icon": "Zap",
      "title": "Headless CMS Upgrade",
      "description": "Upgrade to a modern headless CMS for faster page loads, easier content editing, and future development at half the time per page."
    }
  ],
  "hideDesignIncludes": false,
  "benefits": [
    {
      "icon": "Shield",
      "title": "Audit-Ready",
      "description": "Hits the key checkboxes for UNC brand compliance."
    },
    {
      "icon": "PenTool",
      "title": "Global Changes",
      "description": "Header, footer, fonts, and colors updated site-wide."
    },
    {
      "icon": "Layout",
      "title": "No Content Disruption",
      "description": "All existing content and page layouts stay intact."
    },
    {
      "icon": "Zap",
      "title": "Fast Turnaround",
      "description": "Focused scope means faster delivery before the deadline."
    }
  ],
  "discountPercent": 0,
  "monthlyFee": 0,
  "contactInfo": {
    "name": "Adrial Dale",
    "phone": "(919) 968-8818",
    "email": "adrial@adrialdesigns.com",
    "website": "www.adrialdesigns.com"
  }
}